routes_project/app/controllers/artwork_shares_controller.rb

    def create
        artwork_share = ArtworkShare.new(artwork_shares_params)

        if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 1], ["created_at", "2023-08-17 22:29:21.826137"], ["updated_at", "2023-08-17 22:29:21.826137"]]

    def destroy
        artwork_share = ArtworkShare.find_by(id: params[:id])

        if artwork_share.destroy
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]