routes_project/app/controllers/artworks_controller.rb

    def index

        if params[:user_id]
            render json: Artwork.artworks_for_user_id(params[:user_id])
        else
            render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def show

        artwork = Artwork.find_by(id: params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update

        artwork = Artwork.find_by(id: params[:id])

        if artwork.update(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "test2"], ["updated_at", "2023-08-17 21:46:07.900136"], ["id", 5]]

    def destroy

        artwork = Artwork.find_by(id: params[:id])

        if artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]