routes_project/app/controllers/users_controller.rb

    def update

        user = User.find_by(id: params[:id])

        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "random"], ["updated_at", "2023-08-17 20:44:56.936520"], ["id", 9]]

    def destroy
        user = User.find_by(id: params[:id])

        if user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]